# ----------------------------------------------------------------------
# Test of GEOMETRY ST_SRID
# ----------------------------------------------------------------------
# Must return 0.
SELECT ST_SRID(CAST(ST_GEOMFROMTEXT('POINT(1 1)', 0) AS POINT));
ST_SRID(CAST(ST_GEOMFROMTEXT('POINT(1 1)', 0) AS POINT))
0
#
# Must return 4326.
SELECT ST_SRID(CAST(ST_GEOMFROMTEXT('POINT(45 90)', 4326) AS POINT));
ST_SRID(CAST(ST_GEOMFROMTEXT('POINT(45 90)', 4326) AS POINT))
4326
#
# 
SET @g = ST_GeomFromText('LineString(1 1,2 2)', 0);
SELECT ST_SRID(@g);
ST_SRID(@g)
0
SELECT ST_ASTEXT(ST_SRID(@g, 4326));
ST_ASTEXT(ST_SRID(@g, 4326))
LINESTRING(1 1,2 2)
#
#
SET @g = ST_GeomFromText('MULTIPOINT(1 1, 11 11, 11 21, 21 21)', 2343);
SELECT ST_SRID(@g);
ST_SRID(@g)
2343
SELECT ST_ASTEXT(ST_SRID(@g, 3234));
ST_ASTEXT(ST_SRID(@g, 3234))
MULTIPOINT((1 1),(11 11),(11 21),(21 21))
#
#
SET @g = ST_GeomFromText('Polygon((0 0, 0 8, 8 8, 8 10, -10 10, -10 0, 0 0))', 4326);
SELECT ST_SRID(@g);
ST_SRID(@g)
4326
SELECT ST_ASTEXT(ST_SRID(@g, 2343));
ST_ASTEXT(ST_SRID(@g, 2343))
POLYGON((0 0,8 0,8 8,10 8,10 -10,0 -10,0 0))
#
#
SET @g = ST_GeomFromText('GEOMETRYCOLLECTION(POLYGON((0 0,50 45,40 50,0 0)),LINESTRING(-10 -10,0 0),LINESTRING(46.666666666666664 46.666666666666664,200 200,199 201,45.333333333333336 47.333333333333336),LINESTRING(8 10,-11 -9))', 2343);
SELECT ST_SRID(@g);
ST_SRID(@g)
2343
SELECT ST_ASTEXT(ST_SRID(@g, 2343));
ST_ASTEXT(ST_SRID(@g, 2343))
GEOMETRYCOLLECTION(POLYGON((0 0,50 45,40 50,0 0)),LINESTRING(-10 -10,0 0),LINESTRING(46.666666666666664 46.666666666666664,200 200,199 201,45.333333333333336 47.333333333333336),LINESTRING(8 10,-11 -9))
#
#
SET @g = ST_GeomFromText('GEOMETRYCOLLECTION(GEOMETRYCOLLECTION(),GEOMETRYCOLLECTION EMPTY, GEOMETRYCOLLECTION(POINT(1 1)), MULTILINESTRING((10 48,10 21,10 0),(16 0,16 23,16 48)), MULTIPOLYGON(((28 26,28 0,84 0,84 42,28 26),(52 18,66 23,73 9,48 6,52 18)),((59 18,67 18,67 13,59 13,59 18))), MULTIPOINT((0 0),(10 10),(10 20),(20 20)), MULTIPOINT(1 1, 11 11, 11 21, 21 21), GEOMETRYCOLLECTION(LINESTRING(1 1,2 2)), GEOMETRYCOLLECTION(POLYGON((0 0,50 45,40 50,0 0)),LINESTRING(-10 -10,0 0),LINESTRING(46.666666666666664 46.666666666666664,200 200,199 201,45.333333333333336 47.333333333333336),LINESTRING(8 10,-11 -9)))', 2343);
SELECT ST_SRID(@g);
ST_SRID(@g)
2343
SELECT ST_ASTEXT(ST_SRID(@g, 0));
ST_ASTEXT(ST_SRID(@g, 0))
GEOMETRYCOLLECTION(GEOMETRYCOLLECTION EMPTY,GEOMETRYCOLLECTION EMPTY,GEOMETRYCOLLECTION(POINT(1 1)),MULTILINESTRING((10 48,10 21,10 0),(16 0,16 23,16 48)),MULTIPOLYGON(((28 26,28 0,84 0,84 42,28 26),(52 18,66 23,73 9,48 6,52 18)),((59 18,67 18,67 13,59 13,59 18))),MULTIPOINT((0 0),(10 10),(10 20),(20 20)),MULTIPOINT((1 1),(11 11),(11 21),(21 21)),GEOMETRYCOLLECTION(LINESTRING(1 1,2 2)),GEOMETRYCOLLECTION(POLYGON((0 0,50 45,40 50,0 0)),LINESTRING(-10 -10,0 0),LINESTRING(46.666666666666664 46.666666666666664,200 200,199 201,45.333333333333336 47.333333333333336),LINESTRING(8 10,-11 -9)))
#
# Test for String (creates the geometry in SRID 0, then casts it to SRID 4326)
SELECT ST_ASTEXT(ST_SRID(Point(1, 1), 4326));
ST_ASTEXT(ST_SRID(Point(1, 1), 4326))
POINT(1 1)
SELECT ST_ASTEXT(ST_SRID(POINT(25.416666666666668, 25.416666666666668), 4326));
ST_ASTEXT(ST_SRID(POINT(25.416666666666668, 25.416666666666668), 4326))
POINT(25.416666666666668 25.416666666666668)
SELECT ST_SRID(Point(1, 1), -1);
ERROR 22003: SRID value is out of range in 'st_srid'
SELECT ST_SRID(Point(1, 1), 1e30);
ERROR 22003: SRID value is out of range in 'st_srid'
#
# Test for ->srid 0
select ST_ASTEXT(st_srid(st_geomfromtext('point(90 90)', 4326), 0));
ST_ASTEXT(st_srid(st_geomfromtext('point(90 90)', 4326), 0))
POINT(90 90)
select ST_ASTEXT(st_srid(st_geomfromtext('point(90 90)', 4396), 0));
ST_ASTEXT(st_srid(st_geomfromtext('point(90 90)', 4396), 0))
POINT(90 90)
# Test for invalid input data
select st_srid(st_geomfromtext('point(100 100)'), 4326);
ERROR 22S03: A parameter of function st_srid contains a geometry with latitude 100.000000, which is out of range. It must be within [-90.000000, 90.000000].
#
# Test for setsrid
select ST_ASTEXT(_st_setsrid(point(90,90), 4326));
ST_ASTEXT(_st_setsrid(point(90,90), 4326))
POINT(90 90)
set @g = _st_setsrid(point(100,100), 4326);
ERROR 22S03: A parameter of function _st_setsrid contains a geometry with latitude 100.000000, which is out of range. It must be within [-90.000000, 90.000000].
select _st_setsrid(point(100,100), 4326);
ERROR 22S03: A parameter of function _st_setsrid contains a geometry with latitude 100.000000, which is out of range. It must be within [-90.000000, 90.000000].
# Test for invalid srid
select ST_ASTEXT(st_srid(point(90,90), ''));
ST_ASTEXT(st_srid(point(90,90), ''))
POINT(90 90)
Warnings:
Warning	1292	Truncated incorrect INTEGER value: ''
select ST_ASTEXT(st_srid(point(90,90), 'invalid'));
ST_ASTEXT(st_srid(point(90,90), 'invalid'))
POINT(90 90)
Warnings:
Warning	1292	Truncated incorrect INTEGER value: 'invalid'
#
# Test for srid!=0 && srs_item == null
select st_srid(x'02000000010100000000000000000000000000000000000000');
st_srid(x'02000000010100000000000000000000000000000000000000')
2
Warnings:
Warning	3519	There's no spatial reference system with SRID 2.
#
# Test unusual input (different from st_x/st_buffer..)
select st_srid(1.1);
ERROR 22023: Invalid GIS data provided to function st_srid.
select st_srid(10.2);
ERROR 22023: Invalid GIS data provided to function st_srid.
select st_srid(102342);
ERROR 22023: Invalid GIS data provided to function st_srid.
select st_srid('sdfwefqwe');
ERROR 22023: Invalid GIS data provided to function st_srid.
select st_isvalid(x'e610000001040000000000000000002EC000000000000034C0');
ERROR 22023: Invalid GIS data provided to function st_isvalid.
select st_srid(x'0000000001030000000200000005000000000000000000000000000000000000000000000000002440000000000000000000000000000024400000000000002440000000000000000000000000000024400000000000000000000000000000000005000000000000000000144000000000000014400000000000001C4000000000000014400000000000001C400000000000001C4000000000000014400000000000001C4000000000000014400000000000001441');
st_srid(x'00000000010300000002000000050000000000000000000000000000000000000000000000000024400000000000000000000000000000244000000000000024400000000000000000000000000000244000000000000000000000000000000000050000000000000000001440000000000000144000000000000
0
SELECT _ST_SETSRID(NULL,4326);
ERROR 22023: Invalid GIS data provided to function _st_setsrid.
SELECT _ST_SETSRID('NULL',4326);
ERROR 22023: Invalid GIS data provided to function _st_setsrid.
SELECT _ST_SETSRID(x'02000000010100000000000000000000000000000000000000',NULL);
ERROR 22023: Invalid GIS data provided to function _st_setsrid.
SELECT ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),NULL));
ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),NULL))
NULL
SELECT _ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),'NULL');
ERROR 22007: Incorrect value
SELECT ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),4326));
ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),4326))
POINT(2 1)
SELECT ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),'4326'));
ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),'4326'))
POINT(2 1)
SELECT ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),'4326abc'));
ERROR 22007: Incorrect value
SELECT ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),'true'));
ERROR 22007: Incorrect value
SELECT ST_ASTEXT(_ST_SETSRID(ST_GEOMFROMTEXT('POINT(1 2)'),true));
ERROR 22000: Invalid data type for the operation
SELECT _ST_SETSRID(ST_GEOMFROMTEXT('POINT'),NULL);
ERROR 22023: Invalid GIS data provided to function st_geomfromtext.
select st_astext(st_srid(x'0000000001030000000300000005000000000010000000000000000000000000000000000000002440000000000000000000000000000024400000000000002440000000000000000000000000000024400000000000000000000000000000000005000000000000000000144000000000000014400000000000001C4000000000000014400000000000001C400000000000001C4000000000000014400000000000001C40000000000000144000000000000014410500000000000000000014C000000000000014C00000000000001CC000000000000014C00000000000001CC00000000000001CC000000000000014C00000000000001CC000000000000014C000000000000014C0',0));
st_astext(st_srid(x'0000000001030000000300000005000000000010000000000000000000000000000000000000002440000000000000000000000000000024400000000000002440000000000000000000000000000024400000000000000000000000000000000005000000000000000000144000000000000014400
POLYGON((5.180654e-318 0,10 0,10 10,0 10,0 0),(5 5,7 5,7 7,5 7,5 327680),(-5 -5,-7 -5,-7 -7,-5 -7,-5 -5))
bugfix: 53257405
select st_srid(st_geomfromtext('point(100 100)')) - 3;
st_srid(st_geomfromtext('point(100 100)')) - 3
-3
select weight_string(st_srid(NULL));
weight_string(st_srid(NULL))
NULL
select weight_string(st_srid(3333));
ERROR 22023: Invalid GIS data provided to function st_srid.
